
<p align=left style="padding-left:20px"><b><br>НАЧАЛО РАБОТЫ С ЧАТОМ</b></p>
<p align=left style="padding-left:20px"><b><br>Важное замечание:</b><br>
Чат предназначен для контакта с посетителями сайта с целью сделать из них клиентов компании.<br>
Это и есть основное назначение чата - получить клиента (покупателя).<br>
Поэтому общение в чате не должно быть затяжным и бессмысленным.<br>
Всегда используйте чат в первую очередь для того, чтобы получить больше информации о посетителе и его дополнительных контактах - телефоны, скайп, емейлы,<br> 
чтобы не упустить потенциального клиента и иметь возможность связаться с ним по разным контактам.<br>
И всегда заинтересовывайте посетителя в услугах компании, чтобы он захотел стать нашим клиентом.<br>
</p>
<br>
<p align=left style="padding-left:20px"><b>Описание работы чата на стороне посетителя сайта</b></p>
<p align=left style="padding-left:20px">

Посетители сайта могут начать чат щелкнув мышью на картинке вызова чата <br>
	<span id="phplive_btn_1366901989" onclick="phplive_launch_chat_1(0)" style="color: #0000FF; text-decoration: underline; cursor: pointer;"></span>
	<script type="text/JavaScript">
	{literal}
	(function() {
		var phplive_e_1366901989 = document.createElement("script") ;
		phplive_e_1366901989.type = "text/javascript" ;
		phplive_e_1366901989.async = true ;
		phplive_e_1366901989.src = "//www.carvector.net/phplive/js/phplive_v2.js.php?v=1|1366901989|0|" ;
		document.getElementById("phplive_btn_1366901989").appendChild( phplive_e_1366901989 ) ;
	})();
	{/literal}
	</script>
данная картинка действующая - вы можете щелкнуть ее мышью<br>
и проверить как вызывается окно чата.
<br>
<br>
эта картинка меняется в зависимости от выбранного языка сайта и наличия менеджеров на связи<br>
<img src = "./files/add/chats.png" alt = "" style = "margin: 5px 0;" />
<br><br>
если менеджеров нет на связи, то посетитель может оставить сообщение, которое будет отправлено на почту sales@carvector.com<br>
если на связи (в онлайне) есть хотя бы один менеджер, то у посетителя в браузере откроется отдельное окно начала чата<br><br>
<img src = "./files/add/win_client.png" alt = "" style = "margin: 5px 0;" /><br><br>
как видно на скриншоте, прежде чем начать чат посетитель должен ввести свое имя, емейл и свой вопрос менеджеру<br>
только после этого его вопрос будет отправлен в систему и начнется подключение свободного менеджера-оператора<br><br>
<img src = "./files/add/win_client2.png" alt = "" style = "margin: 5px 0;" /><br><br>
в это время менеджер-оператор получает звуковой сигнал и принимает вызов<br>
когда вызов принят, посетитель видит что к нему подключился менеджер-оператор<br><br>
<img src = "./files/add/win_client3.png" alt = "" style = "margin: 5px 0;" /><br><br>
оператор может просто напечатать ответ посетителю или же он может отправить приветствие, заготовленное заранее, как на картинке ниже<br><br>
<img src = "./files/add/win_client4.png" alt = "" style = "margin: 5px 0;" /><br><br>
при получении ответа оператора у клиента на комьютере раздается звуковой сигнал<br>
и таким образом чат может продолжаться столько, сколько нужно пока один из участников не закончит его.<br>
</p>
<br>
<p align=left style="padding-left:20px"><b>Описание работы чата на стороне оператора</b></p>
<p align=left style="padding-left:20px">
для работы в чате менеджер должен зайти на страничку оператора по ссылке <a href="http://www.carvector.net/phplive/">http://www.carvector.net/phplive/</a><br><br>
<img src = "./files/add/operator2.png" alt = "" style = "margin: 5px 0;" /><br><br>
для входа понадобится логин и пароль, которые выдает администратор сайта<br>
после ввода логина и пароля вы попадаете на страничку оператора<br><br>
<img src = "./files/add/operator3.png" alt = "" style = "margin: 5px 0;" /><br><br>
в верхней части окна располагается меню. при входе вы попадаете в первый пункт меню Go ONLINE!<br>
который дает вам доступ к большой и длинной кнопке, на которой написано "Launch operator console to accept visitor chat requests"<br>
то есть позволяет вам запустить консоль оператора, чтобы отвечать на запросы посетителей<br>
Консоль оператора - это отдельное специальное окно для непосредственной рабты в чате<br>
Нажмите на эту большую кнопку и у вас появиться отдельное окно консоли<br><br>
<img src = "./files/add/operator4.png" alt = "" style = "margin: 5px 0;" /><br><br>
чтобы работать в чате вам необходимо держать это окно открытым или свернутым<br>
при закрытии окна консоли вы отключаетесь и выходите из чата<br>
когда посетитель отправляет первое сообщение оператор получает уведомление о начале чата<br><br>
<img src = "./files/add/operator5.png" alt = "" style = "margin: 5px 0;" /><br><br>
в верхней части окна консоли появляется вкладка с именем посетителя, а в правой части в табличке отображается информация о посетителе<br>
оператор может принять чат, нажав кнопку "accept" или, если он очень занят, отклонить чат, нажав "decline"<br>
при отклонении посетитель будет перенаправлен к другому оператору или если их нет, то переводится в режим отправки сообщения<br>
после нажатии "accept" посетителю отправляется сообщение о подключении оператора<br><br> 
<img src = "./files/add/operator6.png" alt = "" style = "margin: 5px 0;" /><br><br>
оператор может набрать ответ вручную или вставить в чат заготовленные заранее тексты из списка "Canned Responses"<br>
(выбрать из выпадающего списка и нажать кнопочку "select")<br>
остается только нажать кнопку "Submit" чтобы оптравить сообщение посетителю и продолжить с ним работать через чат.<br><br>
<img src = "./files/add/operator7.png" alt = "" style = "margin: 5px 0;" /><br><br>
<br><br>
Теперь краткое описание вкладок в левой части окна консоли<br>
Visitor Info - как следует из названия, это вся имеющаяся информация о посетителе<br>
А именно:<br>
Department - это отдел в системе чата, их создано два - Sales RU и Sales EN, соответственно для русскоязычних и англоязычных посетителей<br>
операторы назначаются в эти отделы. таким образом если оператор не знает английского языка, то англоязычные посетители к нему не будут направляться<br>
Visitor Email - это емейл, который посетитель ввел в начале чата<br>
Chat reuest - подсчитывает сколько раз этот посетитель обращался в чат<br>
Cliced From - сайт с которого пришел посетитель<br>
Refer URL - ссылка с которой пришел посетитель<br>
Marketing - неизвестно<br>
Resolution - разрешение экрана на компьютере посетителя, операционная система и название браузера, которые он использует<br>
IP / Hostname - IP адрес посетителя или имя его хостинга<br>
Custom Vars - неизвестно<br>
Session ID - номер сессии, то есть непрерывного подключения к системе чата<br>
<br><br>
GeoMap - демонстрация географического положения посетитея на карте Google по его IP адресу<br>
Footprint - запись предыдущих посещенных страниц сайта<br>
Transcripts - хранилище прошлых чатов<br>
Transfer - переключение посетителя на другого оператора<br>
Spam - блокирование текущего посетителя на случай его неадекватности<br>
<br><br>
в нижней части консоли<br>
Operaators - список операторов в онлайне<br>
Traffic Monitor - контроль посещаемости сайта<br>
Canned Responses - заготовки для быстрого ответа посетителю<br>
Transcripts - хранилище прошлых чатов<br>
Admin CarVectoR - быстрый переход на админ страничку сайта carvector в окне консоли<br>
OCS - быстрый переход на страничку OCS в окне консоли<br>
<br>
Пункты меню на страничке оператора:<br>
<img src = "./files/add/operator3.png" alt = "" style = "margin: 5px 0;" /><br>
Transcripts - хранилище прошлых чатов<br>
Themes - варианты внешнего оформления чата данного оператора<br>
Sounds - настройка звуков системы при отправке и получении сообщений<br>
Desktop Alert - установка сигнального виджета на рабочем столе<br>
SMS - система отправки СМС сообщений на мобильный телефон при появлении обращения в чат (в нашей стране не работает)<br>
Canned Responses - заготовки для быстрого ответа посетителю<br>
Online Acivity - отчет об онлайн активности оператора<br>
Password - смена пароля оператора
</p>




