<p align=left style="padding-left:20px"><b><br>Возможность приглашать посетителей сайта в чат</b></p>
<p align=left style="padding-left:20px">
Операторы могут сами начинать чат с посетителями.<br><br>
Для этого нажмите на Traffic Monitor<br>
<img src = "./files/add/chat2_1.png" alt = "" style = "margin: 5px 0;" /><br>
цифра 06 в данном случае показывает количество посетителей,<br>
которые просматривают наш сайт прямо сейчас.<br>
<br>
Пикающие звуки сопровождают появление и исчезновение посетителей на сайте.<br>
<br>
Посте нажатия на Traffic Monitor вы увидите список этих посетителей<br>
<img src = "./files/add/chat2_2.jpg" alt = "" style = "margin: 5px 0;" /><br>
тут видна информация от текущих посетителях - страна, IP-адрес, операционная система на их компьютерах,<br>
их бразуер, на какой страничке нашего сайта они находятся и с какой странички пришли.<br>
<br>
если нажать на звездочку-шестеренку<br>
<img src = "./files/add/chat2_3.png" alt = "" style = "margin: 5px 0;" /><br>
<br>
то откроется еще одно окошко с вкладками, одна из них называется Initiate Chat<br>
<img src = "./files/add/chat2_4.png" alt = "" style = "margin: 5px 0;" /><br>
<br>
можно ввести сообщение или выбрать заготовку и посте нажатия кнопки внизу у клиента в браузере появится приглашение к чату<br>
<br>
<img src = "./files/add/chat2_5.png" alt = "" style = "margin: 5px 0;" /><br>
<br>
Пожалуйста используйте эту возможность привлечь клиентов.
</p>
<br>